using System;

//    Первый шаг
//    Любая, даже самая сложная дорога, начинается с первого шага.
//
//    Выведите на консоль фразу The first step!
//
//    Допишите код метода Main, а затем запустите и проверьте ваше решение с помощью кнопки «Отправить».
//
//    Считайте, что инструкции using и namespace уже написаны за вас, осталось написать только тело метода.

namespace LearningCSharp
{
    class Program
    {
        public static void Main(string[] args)
        {
            Console.WriteLine("The first step!");
        }
    }
}